// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// Пример:
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

Console.Write("Введите первое число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите первое число: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите первое число: ");
int c = Convert.ToInt32(Console.ReadLine());
if(int a = maximum)
if (b > maximum)
{

}

if(a > b > c)
{
    Console.WriteLine(a);
}
if(b > c)
{
    Console.WriteLine(b);

}


else
{
    Console.WriteLine(c);
}


