// Напишите программу, которая принимает на вход число (А) и 
// выдаёт сумму чисел от 1 до А.
// 7 -> 28
// 4 -> 10
// 8 -> 36

Console.WriteLine("Введите число:");
int number = Convert.ToInt32(Console.ReadLine());


Console.WriteLine(result);


